[{"#": "1", "href": "/roster.aspx?rp_id=14221", "Full Name": "Brandon Riley", "Pos.": "OF", "Ht.": "6-0", "Wt.": "175", "Academic Year": "Jr.", "Hometown / High School": "Burlington, N.C. / Williams", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Dynamic outfielder who figures to be among the team leaders as a junior.\r\n\r\nSophomore Season (2017)\r\nHit .317 with seven homers, nine doubles and a team-high 52 RBIs • Also scored 46 runs, drew 37 walks and led the team with five triples, which is tied for 10th-most in UNC history for a single season • Appeared in all 63 games and started 62, primarily in right field • Stole 10 bases in 14 attempts • Had 21 multi-hit games, including a season-high three hits on eight occasions • Also drove in multiple runs 14 times, including a season-best four at ECU on March 22 • Followed up the ECU game with a big series against Miami, recording six hits and driving in four runs with a homer • Earned ACC Player of the Week honors for his efforts • Had eight hits, drove in three runs and scored three times in the NCAA Chapel Hill Regional • Was 2 for 3 with three RBIs in the win over NC State in the ACC tournament • Homered in back-to-back games at Pitt and at home against Elon on April 23 and 25 • Stole a career-best three bases against NC State on April 14 • Started his sophomore season with a bang, reaching base in seven of the first eight games, including a three-hit performance in the Opening Day win over Kentucky. \r\n\r\nFreshman Season (2016)\r\nSweet-swinging newcomer made an immediate impact in the lineup, starting 51 games at designated hitter and in the outfield • Hit .294 with a team-high 16 doubles, three triples and a homer • Had 17 multi-hit games on the year, including a season-high four hits against Fairfield on March 5 and Davidson on March 29 • Drove in multiple runs eight times, including a season-best four against William & Mary on April 20 • Stole three bases in four attempts, including a steal of home against Gardner-Webb on March 8 • Opened his career with a two-run double at UCLA on Opening Day that helped lift the Tar Heels to a win against the Bruins • Clubbed his first career home run against Fairfield on March 6 • Named to the ACC Academic Honor Roll.\r\n\r\nWilliams High School\r\nFour-time all-conference performer and named first-team all-state as a senior after hitting .460 • Ranked the No. 11 outfielder and the No. 36 overall player in the state of North Carolina by Perfect Game • Also considered the No. 146 outfielder nationally • Earned Underclass High Honorable Mention from PG in 2014 • Named to the all-tournament team at the 2012 PG WWBA Underclass World Championship • Coached by Jason Knapp at Williams.\r\n\r\nPersonal\r\nAlex Brandon Riley is the son of Linda and Jay Riley • Uncle played baseball at UNC • Birthday is Dec. 13 • Has not yet declared a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Riley_Brandon_bb_12.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14221&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".294", "gp": "54", "gs": "51", "ab": "194", "r": "27", "h": "57", "2b": "16", "3b": "3", "hr": "1", "rbi": "35", "slg%": ".423", "bb": "20", "hbp": "1", "so": "28", "gdp": "3", "ob%": ".355", "sf": "5", "sh": "2", "sb": "3", "po": "13", "a": "0", "e": "1", "fld%": ".929", "year": "2016"}, {"avg": ".317", "gp": "63", "gs": "62", "ab": "224", "r": "46", "h": "71", "2b": "9", "3b": "5", "hr": "7", "rbi": "52", "slg%": ".496", "bb": "37", "hbp": "0", "so": "34", "gdp": "6", "ob%": ".406", "sf": "5", "sh": "2", "sb": "10", "po": "106", "a": "1", "e": "4", "fld%": ".964", "year": "2017"}]}}}, {"#": "2", "href": "/roster.aspx?rp_id=14226", "Full Name": "Satchel Jerzembeck", "Pos.": "IF", "Ht.": "5-10", "Wt.": "150", "Academic Year": "Fr.", "Hometown / High School": "Charlotte, N.C. / Providence", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Providence High School\r\nNo. 8 shortstop in North Carolina • 2017 Rawlings-Perfect Game Honorable Mention All-American • All-Atlantic Region Second Team • Led Providence to 2015 state championship • Coached by Danny Hignight.\r\n\r\nPersonal\r\nSon of former Tar Heel pitcher Mike Jerzembeck who was drafted by the New York Yankees in 1993 • Named after Satchel Paige • Son of Alison and Mike Jerzembeck • Born on July 7 • Has yet to declare a major at Carolina\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Jerzembeck_Satchel_bb_40.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14226&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "3", "href": "/roster.aspx?rp_id=14211", "Full Name": "Kyle Datres", "Pos.": "3B", "Ht.": "6-0", "Wt.": "198", "Academic Year": "Jr.", "Hometown / High School": "Williamsport, Pa. / Loyalsock Township", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nAthletic infielder who started all 63 games at third base during his sophomore season • Hit .265 with seven homers, 13 doubles and 51 RBIs • Also scored 48 runs and drew 29 walks • Was hit by a pitch a team-high 20 times, the 13th-most HBPs in the country • Had 16 multi-hit games, including a season-high three on five occasions • Finished the NCAA Chapel Hill Regional with four hits, including two in the win over FGCU • Had three hits and four RBIs in the ACC tournament • Drove in multiple runs 13 times, including a season-high four RBIs on four occasions • Finished with a homer and four RBIs in the win at Virginia Tech on May 14, capping a six-hit series • Scored three times and drove in four runs in the win over South Carolina in Charlotte on April 11 • Went 7 for 11 with two homers, two doubles, six runs and eight RBIs in the sweep at Boston College • Had a homer and three RBIs against Coastal Carolina on March 28 • Homered and had three hits at Georgia Tech on March 17 • Had three hits and two RBIs in the win over Virginia on March 10 • Also had four RBIs against Radford on Feb. 25 • Hit his first home run of the year against Gardner-Webb on Feb. 22.\r\n\r\nFreshman Season (2016)\r\nAthletic infielder who figures to be a fixture in the Carolina lineup moving forward • Started 41 games and appeared in 53 as a true freshman • Primarily featured at third base, starting 31 games at the hot corner • Hit .250 with six doubles, three homers and 23 RBIs • Also scored 39 runs and drew 27 walks • Finished a perfect 6 for 6 in stolen base attempts • Had 10 multi-hit games, including a career-high four in the win at NC State on May 20 • Got off to a hot start to his career, reaching base in his first seven games • Had three straight two-hit games in February wins over UCLA and Oklahoma State, including a walk-off double against the Cowboys on the Feb. 26 • Hit his first career home run against Virginia Tech on April 8 • Also homered at Virginia on April 16 and against Notre Dame on May 16 • Drove in a season-high three runs against South Carolina on April 13 • Had a standout summer in the Cal Ripken League, winning a batting title for the Baltimore Redbirds with a .378 batting average, 22 stolen bases and four homers.\r\n\r\nLoyalsock Township High School\r\nTalented all-around athlete who was all-state in football and basketball as well as baseball • Was runner-up for Mr. Pennsylvania Football and an all-state quarterback as a senior • Was three-time all-state in baseball, leading his team to a pair of state titles • 2015 National Football Foundation Scholar-Athlete Award recipient • Member of the National Honor Society • Four-time conference academic all-star in basketball • Ranked the No. 57 shortstop in the country and the No. 3 shortstop in the state of Pennsylvania by Perfect Game • Also considered the No. 12 overall player in the Keystone State • Two-way player who earned Underclass High Honorable Mention from PG in 2013 and 2014 • Coached by Jeremy Eck at Loyalsock Township. \r\n\r\nPersonal\r\nKyle Joseph Datres is the son of Cindy and Lynn Datres • Birthday is Jan. 5 • Mother was the first woman to play three sports at Williamsport High and was undefeated as a college tennis player • Sister Kelli was a three-time gymnastics state champion and sister Kerri played two seasons at Lebanon Valley College • Brother Kory was a four-time state champion in baseball and twice played in the Big League World Series • Father was an assistant coach for the 1984 AAA Pennsylvania state championship basketball team • Has not yet declared a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Datres_Kyle_bb_48.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14211&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".250", "gp": "53", "gs": "41", "ab": "152", "r": "39", "h": "38", "2b": "6", "3b": "2", "hr": "3", "rbi": "23", "slg%": ".375", "bb": "27", "hbp": "8", "so": "28", "gdp": "4", "ob%": ".384", "sf": "3", "sh": "7", "sb": "6", "po": "34", "a": "64", "e": "8", "fld%": ".925", "year": "2016"}, {"avg": ".265", "gp": "63", "gs": "63", "ab": "230", "r": "48", "h": "61", "2b": "13", "3b": "1", "hr": "7", "rbi": "51", "slg%": ".422", "bb": "29", "hbp": "20", "so": "45", "gdp": "6", "ob%": ".391", "sf": "2", "sh": "4", "sb": "4", "po": "32", "a": "109", "e": "6", "fld%": ".959", "year": "2017"}]}}}, {"#": "4", "href": "/roster.aspx?rp_id=14219", "Full Name": "Brandon Martorano", "Pos.": "C/OF", "Ht.": "6-2", "Wt.": "187", "Academic Year": "So.", "Hometown / High School": "Marlboro, N.J. / Christian Brothers Academy", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nAppeared in 36 games and started 14 primarily at catcher during his freshman season • Hit. 068 with five RBIs and five runs scored • Had hits in two of three games in the season-opening sweep of Kentucky • Recorded his first career RBI against Long Beach State on March 4 • Threw out four of 10 potential base stealers behind the plate.\r\n\r\nChristian Brothers Academy\r\nRanked as the No. 7 catcher and the No. 53 player overall in Prep Baseball Report's national coverage area • Selected in the 30th round of the 2016 MLB Draft by the Arizona Diamondbacks • Also ranked No. 208 nationally by Baseball America in the BA500 and No. 134 by Perfect Game • Two-time first-team All-Metro and all-state selection • Won a gold medal with USA Baseball in 2013 • Helped lead his team to the 2015 state title as a junior • Considered the No. 1 position player and the No. 6 player overall in the state of New Jersey by Perfect Game • 2016 Rawlings-Perfect Game 3rd Team All-American • 2015 PG Underclass All-America (second team) • MVP of PG World Championships last October • Coached by Marty Kenny • Brandon Salvatore Martorano is the son of Salvatore and Christie Martorano • Birthday is Jan. 6.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Martorano_Brandon_bb_67.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14219&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".068", "gp": "36", "gs": "14", "ab": "44", "r": "5", "h": "3", "2b": "0", "3b": "0", "hr": "0", "rbi": "5", "slg%": ".068", "bb": "6", "hbp": "2", "so": "13", "gdp": "3", "ob%": ".208", "sf": "1", "sh": "2", "sb": "0", "po": "91", "a": "12", "e": "0", "fld%": "1.000", "year": "2017"}]}}}, {"#": "5", "href": "/roster.aspx?rp_id=14220", "Full Name": "Ashton McGee", "Pos.": "OF/2B/3B", "Ht.": "6-2", "Wt.": "215", "Academic Year": "So.", "Hometown / High School": "Pikeville, N.C. / C.B. Aycock", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nGraduated from high school in December of 2016 and enrolled at UNC in January • Hit .327 with seven homers, 10 doubles and 46 RBIs • Also scored 45 runs and drew 36 walks • Appeared in 58 games and made 57 starts, primarily at designated hitter • Consensus freshman All-American who earned first-team honors from Baseball America, Collegiate Baseball, D1Baseball, NCBWA and Perfect Game • ABCA/Rawlings second-team all-region selection • Became the sixth player in program history to be named ACC Freshman of the Year • Had three hits and two RBIs in the NCAA Chapel Hill Regional • Had six hits, five RBIs, six runs scored and a homer in the ACC tournament to earn all-tournament honors • Had a late season surge that saw him raise his batting average 50 points with a team-best 18-game hitting streak from April 23 to May 27 • Had 24 multi-hit games on the year, including a season-best three hits on six occasions • Was second on the team with a .333 average in ACC play • Drove in multiple runs 12 times, including a season-high four RBIs against Maryland on March 14 • Homered twice in the sweep at Florida State • Hit safely in each of his first four career games, including a double in his UNC debut against Gardner-Webb on Feb. 22.\r\nC.B. Aycock High School\r\nNamed a Perfect Game 2016 Underclass All-American (first team) • Also earned High Honorable Mention in 2015 • Enrolled in January after graduating early from high school • Led his team to a 3A title as a junior and earned first-team all-county honors in the process • Member of the National Honor Society • Played for Charles Davis • Ashton McGee is the son of Darren and Theresa McGee • Birthday is Nov. 19.\r\n                        \r\n                    ", "img": "/images/2018/1/31/McGee_Ashton_bb_62_71.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14220&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".327", "gp": "58", "gs": "57", "ab": "223", "r": "45", "h": "73", "2b": "10", "3b": "2", "hr": "7", "rbi": "46", "slg%": ".484", "bb": "36", "hbp": "2", "so": "57", "gdp": "4", "ob%": ".417", "sf": "5", "sh": "0", "sb": "1", "po": "21", "a": "12", "e": "2", "fld%": ".943", "year": "2017"}]}}}, {"#": "6", "href": "/roster.aspx?rp_id=14228", "Full Name": "Dylan Enwiller", "Pos.": "OF/2B", "Ht.": "6-2", "Wt.": "186", "Academic Year": "Jr.", "Hometown / High School": "Chandler, Ariz. / Hamilton", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Prior to UNC\r\nSpent two seasons at Yavapai College • Led Yavapai to the 2016 JUCO World Series championship • Hit .338 with nine home runs and 39 RBI during his sophomore season • Named to JUCO Arizona All-Star Game in 2016-17 • 2017 ACCAC First-Team All Conference • Won the 2014 state championship at Hamilton High School • Named second team all-state and first team all-section • Career batting average of .442 at Hamilton High School.\r\n\r\nPersonal\r\nDylan is the son of Hillis and Jon Enwiller • Was named to the Dean’s List both years at Yavapai College and graduated with high honors • Both parents went to Arizona State University • Dylan’s brother played baseball at Adams State University.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Enwiller_Dylan_bb_34.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14228&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "7", "href": "/roster.aspx?rp_id=14229", "Full Name": "Dallas Tessar", "Pos.": "SS/OF", "Ht.": "6-0", "Wt.": "175", "Academic Year": "R-So.", "Hometown / High School": "Simi Valley, Calif. / Chaminade", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Prior to UNC\r\nNamed to 2015 Perfect Game Honorable Mention All American team as well as California All Region Honorable Mention • In senior season he batted .250 with 7 RBI’s, 3 doubles, and 3 home runs • Finished overall with a .276 batting average, 27 hits, 15 RBI’s and 20 runs scored (2011-2014) • Spent  the 2017 season with Yavapai College where he batted .307 with five home runs, 27 RBI and 48 runs scored • 2017 first team All-Conference • 2017 second team All-State • Was a member of the University of Washington baseball team in 2016 but did not play due to injury.\r\n\r\nPersonal\r\nDallas is the son of Carla and Bill Tessar • Born on July 25 • Father Bill was a decathlete in college • Brother Bando was a pitcher for the University of Oregon and was drafted by the Arizona Diamondbacks.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Tessar_Dallas_bb_25.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14229&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "8", "href": "/roster.aspx?rp_id=14212", "Full Name": "Ike Freeman", "Pos.": "SS/2B", "Ht.": "5-10", "Wt.": "199", "Academic Year": "So.", "Hometown / High School": "Rockwell, N.C. / East Rowan", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nTalented defensive infielder who saw action primarily at second base during his freshman campaign • Appeared in 39 games and started 14 at second • Hit .174 with a homer, three doubles and eight RBIs • Had an RBI double against NC State in the ACC tournament • Finished with a pair of hits and a run scored at Pitt on April 21 • Scored a pair of runs in the win over Miami on March 25 • Drove in a pair against Maryland on March 14 • Had his first two career hits, a double and a home run, against Long Beach State on March 5.\r\nEast Rowan High School\r\nRanked as the No. 9 shortstop and the No. 32 player overall in the state of North Carolina by Perfect Game USA • Also ranked among the top 500 players nationally by PG • 2016 Rawlings-Perfect Game Honorable Mention All-American • Atlantic - All Region 2nd Team • 2015 PG Underclass High Honorable Mention • An all-state performer as a senior • Also earned county and conference player of the year honors • Hit .518 as a senior and graduated with honors • Played for Brian Hightower • Isaac Dale Freeman is the won of Russ and Wendy Freeman • Father was a college wrestler and comes from a long line of D1 wrestlers • Birthday is June 17.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Freeman_Ike_bb_37.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14212&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".174", "gp": "39", "gs": "14", "ab": "46", "r": "13", "h": "8", "2b": "3", "3b": "0", "hr": "1", "rbi": "8", "slg%": ".304", "bb": "7", "hbp": "1", "so": "10", "gdp": "0", "ob%": ".286", "sf": "2", "sh": "4", "sb": "0", "po": "24", "a": "50", "e": "2", "fld%": ".974", "year": "2017"}]}}}, {"#": "10", "href": "/roster.aspx?rp_id=14213", "Full Name": "Zack Gahagan", "Pos.": "1B/3B/2B", "Ht.": "6-2", "Wt.": "211", "Academic Year": "Sr.", "Hometown / High School": "Fletcher, N.C. / North Henderson", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Junior Season (2017)\r\nVersatile veteran who can play all over the diamond • Was drafted in the 39th round by the Cincinnati Reds in the 2017 MLB Draft • Appeared in 62 games as a junior and made 61 starts, splitting time between first base and second • Hit .243 with seven homers, nine doubles and 42 RBIs • Also scored 45 runs, drew 33 walks and was hit by a pitch 10 times • Had 12 multi-hit games, including a season-high three against Long Beach State on March 4 • Drove in multiple runs 10 times, including a career-best five RBIs at Virginia Tech on May 14 • Hit safely in all four games of the NCAA Chapel Hill Regional, including a pair of singles against Davidson • Had a double and two RBIs in the win over Boston College at the ACC tournament • Homered and scored three times in the regular season finale against Duke on May 20 • Homered in consecutive games at Boston College, driving in six runs and scoring five runs over the two contests • Collected four hits in the sweep at Florida State • Drove in three runs and hit a homer in the series opener against Virginia on March 10.\r\n\r\nSophomore Season (2016)\r\nTalented infielder established himself in the middle of the Carolina lineup as a sophomore • Appeared in 51 games and started 42 at the corner infield positions • Hit. .297 with six doubles and five homers • Drove in 34 runs and scored 24 • Had 10 multi-hit games, including a career-high four hits against Winthrop on March 2 • Also had 12 multi-RBI performances, third-most on the team • Matched a career high with four RBIs in the win at Duke on March 18 • Homered at UCLA on Feb. 21 to help clinch at series win • Drove in three runs and hit his fourth home run of the year against Coastal Carolina on April 19 • Finished the year strong, reaching base in 11 of the last 14 games.\r\n\r\nFreshman Season (2015)\r\nAthletic corner infielder appeared in 52 games and made 41 total starts and first and third • Hit .214 with four doubles, two home runs and 32 RBIs • Also scored 19 runs and stole three bases • Committed just seven errors in 223 chances for a .969 fielding percentage • Drove in the game-winning run with a bases loaded hit by pitch to beat NC State and clinch the series win (4/11) • Matched a season-high with four RBIs in the series finale against Miami (3/29) • Had two hits on eight occasions • Drove in four runs and scored two against Davidson (3/17) • Clubbed his second career home run in the series finale against Duke (3/8) • Had two hits, including his first collegiate homer, at Liberty (3/2) • Finished with a hit and a run scored in his first career start against Seton Hall (2/14).\r\n\r\nNorth Henderson High School\r\nRanked the No. 2 shortstop and the No. 15 player overall in North Carolina by Perfect Game • Considered the No. 76 shortstop in the county by PG • 2013 Underclass High Honorable Mention by PG • Coached by Justin King at North Henderson High School.\r\n\r\nPersonal\r\nZack David Gahagan is the son of Mike and Amy Gahagan • Birthday is Aug. 3 • Majoring in exercise and sport science at Carolina with a concentration in sport administration.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Gahagan_Zack_bb_52.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14213&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".216", "gp": "52", "gs": "41", "ab": "153", "r": "19", "h": "33", "2b": "4", "3b": "1", "hr": "2", "rbi": "32", "slg%": ".294", "bb": "14", "hbp": "3", "so": "32", "gdp": "3", "ob%": ".291", "sf": "2", "sh": "1", "sb": "3", "po": "187", "a": "29", "e": "7", "fld%": ".969", "year": "2015"}, {"avg": ".297", "gp": "51", "gs": "42", "ab": "148", "r": "24", "h": "44", "2b": "6", "3b": "0", "hr": "5", "rbi": "34", "slg%": ".439", "bb": "22", "hbp": "2", "so": "29", "gdp": "3", "ob%": ".391", "sf": "2", "sh": "7", "sb": "1", "po": "151", "a": "40", "e": "11", "fld%": ".946", "year": "2016"}, {"avg": ".243", "gp": "62", "gs": "61", "ab": "210", "r": "45", "h": "51", "2b": "9", "3b": "0", "hr": "7", "rbi": "42", "slg%": ".386", "bb": "33", "hbp": "10", "so": "51", "gdp": "4", "ob%": ".366", "sf": "4", "sh": "3", "sb": "6", "po": "237", "a": "105", "e": "9", "fld%": ".974", "year": "2017"}]}}}, {"#": "11", "href": "/roster.aspx?rp_id=14222", "Full Name": "Cody Roberts", "Pos.": "C", "Ht.": "6-0", "Wt.": "202", "Academic Year": "Jr.", "Hometown / High School": "Johns Creek, Ga. / Blessed Trinity", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Elite defensive catcher with a big arm who enters 2018 poised for a breakout season.\r\n\r\nSophomore Season (2017)\r\nAppeared in 62 games and started 58, primarily at catcher • Also saw time at first base and designated hitter • Hit .268 with two homers, 11 doubles and 27 RBIs • Scored 44 runs, drew 26 walks and was hit by a pitch nine times • Also a perfect 5 for 5 in stolen bases • Threw out nine would-be base stealers and also picked off a runner • Worked with a pitching staff that posted a 2.96 ERA and struck out 544 batters on the year • Had 11 multi-hit games, including a season-high three hits on three occasions • Also drove in multiple runs five times • Had a base hit in all four NCAA Chapel Hill Regional games, including a 3 for 4 performance in the win over FGCU • Had two hits and drove in three runs in the ACC tournament • Had perhaps the best offensive game of his career in the win at Boston College on April 9, going 3 for 3 with two doubles, two RBIs and four runs scored • That outburst came in the midst of a 12-game hitting streak that stretched from April 1 to April 21 and featured five multi-hit games.\r\n\r\nFreshman Season (2016)\r\nAthletic catcher with a big arm who started 52 games behind the plate as a true freshman • Also made one appearance on the mound, retiring both batters he faced against Fairfield on March 6 • Hit. 256 with five doubles, a triple and a homer • Also drove in 29 runs and scored 27 • Threw out 48 percent of would-be base stealers (13 of 27) and also picked off four runners • Had six multi-hit games, including a season-high three against Oklahoma State on Feb. 27 • Drove in multiple runs seven times, with a season-best of three against Pitt (March 11) and at East Carolina (March 15) • Hit his first career home run against Notre Dame on May 14.\r\n\r\nBlessed Trinity High School\r\nTwo-time Georgia 3A player of the year • Led team to a pair of state titles and hit .500 in the regular season of his senior year • Ranked the No. 4 catcher and the No. 25 player overall in the state of Georgia by Perfect Game • Also considered the No. 20 catcher nationally by PG • Earned Underclass Honorable Mention in 2013 and Underclass High Honorable Mention in 2014 from PG • Named to the Top Prospect Team at the 2014 National Showcase in Fort Myers, Fla. • Coached by Andy Harlin at Blessed Trinity.\r\n\r\nPersonal\r\nCody Ryan Roberts is the son of Gayle and Scott Roberts • Birthday is June 16 • Father played football at Wake Forest • Brother plays football and baseball at Birmingham Southern • Has not yet declared a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Roberts_Cody_bb_54.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14222&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "0.00", "w": "0", "l": "0", "app": "1", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "0.2", "h": "0", "r": "0", "er": "0", "bb": "0", "so": "0", "2b": "0", "3b": "0", "hr": "0", "bf": "2", "bavg": ".000", "wp": "0", "hbp": "0", "bk": "0", "sfa": "0", "sha": "0", "year": "2016"}, {"era": "0", "w": "0", "l": "0", "app": "0", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "0", "h": "0", "r": "0", "er": "0", "bb": "0", "so": "0", "2b": "0", "3b": "0", "hr": "0", "bf": "0", "bavg": "0", "wp": "0", "hbp": "0", "bk": "0", "sfa": "0", "sha": "0", "year": "2017"}], "Hitting Statistics": [{"avg": ".256", "gp": "55", "gs": "52", "ab": "168", "r": "27", "h": "43", "2b": "5", "3b": "1", "hr": "1", "rbi": "29", "slg%": ".315", "bb": "15", "hbp": "3", "so": "30", "gdp": "4", "ob%": ".323", "sf": "3", "sh": "15", "sb": "3", "po": "462", "a": "40", "e": "6", "fld%": ".988", "year": "2016"}, {"avg": ".268", "gp": "62", "gs": "58", "ab": "198", "r": "44", "h": "53", "2b": "11", "3b": "2", "hr": "2", "rbi": "27", "slg%": ".374", "bb": "26", "hbp": "9", "so": "29", "gdp": "3", "ob%": ".371", "sf": "4", "sh": "5", "sb": "5", "po": "472", "a": "39", "e": "5", "fld%": ".990", "year": "2017"}]}}}, {"#": "12", "href": "/roster.aspx?rp_id=14218", "Full Name": "Josh Ladowski", "Pos.": "OF", "Ht.": "5-10", "Wt.": "193", "Academic Year": "Jr.", "Hometown / High School": "Mooresville, N.C. / Lake Norman", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nAppeared in 24 games and made one start in the outfield • Hit .333 with four RBIs and five runs scored • Drove in a pair of runs in the win over UNC Asheville on May 10 • Had his first career two-hit game with a pair of singles against St. John's on March 1.\r\n\r\nFreshman Season (2016)\r\nAthletic outfilder who was limited to just seven games due to injury • Scored a run in the win vs. South Carolina on April 13.\r\n\r\nLake Norman High School\r\nAll-state performer after hitting .507 as a senior • Ranked the No. 8 outfielder and the No. 31 overall player in the state of North Carolina by Perfect Game • Also considered the No. 127 outfielder nationally • Earned Underclass High Honorable Mention from PG in 2014 • Also played football and was named North Carolina Gatorade Player of the Year in 2014 • Coached by Robert Little at Lake Norman. \r\n\r\nPersonal\r\nJoshua Robert Ladowski is the son of Andrea and Robert Ladowski • Birthday is July 1 • Has not yet declared a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Ladowski_Josh_bb_70.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14218&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".000", "gp": "7", "gs": "0", "ab": "5", "r": "1", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "1", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "3", "a": "0", "e": "0", "fld%": "1.000", "year": "2016"}, {"avg": ".333", "gp": "24", "gs": "1", "ab": "21", "r": "5", "h": "7", "2b": "0", "3b": "0", "hr": "0", "rbi": "4", "slg%": ".333", "bb": "2", "hbp": "0", "so": "7", "gdp": "2", "ob%": ".391", "sf": "0", "sh": "0", "sb": "0", "po": "4", "a": "0", "e": "1", "fld%": ".800", "year": "2017"}]}}}, {"#": "15", "href": "/roster.aspx?rp_id=14207", "Full Name": "Michael Busch", "Pos.": "1B", "Ht.": "5-10", "Wt.": "207", "Academic Year": "So.", "Hometown / High School": "Inver Grove Heights, Minn. / Simley", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nTalented first baseman who had a knack for coming up with clutch hits in his first season as a Tar Heel • Started 38 games and appeared in 55 as a true freshman, primarily at first base • Hit .215 with three homers, eight doubles and 22 RBIs • Also scored 21 runs and drew 27 walks • Had three hits in the NCAA Chapel Hill Regional, including a double against Michigan and a homer against Davidson • Had a run-scoring double in the ACC tournament title game against Florida State • His bases-clearing double against Clemson on April 28 lifted the Tar Heels to a Friday night victory • Drove in six runs in three games in the sweep at Boston College • Had two of the most dramatic hits of the season in back-to-back games at Florida State • His game-tying single with two outs in the ninth broke up a no-hitter before the Tar Heels rallied to win in extras on Saturday night • One day later, his two-run homer in the ninth broke a 7-7 tie to complete UNC's first-ever sweep in Tallahassee • Hit his first career home run at Georgia Tech on March 18 • Named to the ACC Academic Honor Roll.\r\nSimley High School\r\nRanked as the No. 3 player in Minnesota and the No. 1 shortstop in the state by Perfect Game • Also considered the No. 112 player nationally and the No. 17 shortstop in Prep Baseball Report's national coverage area • Listed among the top 500 players in the country by Perfect Game • 2016 PG High Honorable Mention All-American • 2015 PG Underclass High Honorable Mention All-American • Coached by Kevin Kirkwold • Also played three years of varsity football and hockey, leading his team to a state final as a quarterback • Captained all three teams and earned all-state honors in baseball • Michael James Busch is the son of Mike and Judy Busch • Has five sisters and two brothers • Brother Logan plays baseball at North Dakota State • Birthday is Nov. 9.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Busch_Michael_bb_56.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14207&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".215", "gp": "55", "gs": "38", "ab": "135", "r": "21", "h": "29", "2b": "8", "3b": "0", "hr": "3", "rbi": "22", "slg%": ".341", "bb": "27", "hbp": "2", "so": "32", "gdp": "4", "ob%": ".349", "sf": "2", "sh": "2", "sb": "2", "po": "286", "a": "35", "e": "2", "fld%": ".994", "year": "2017"}]}}}, {"#": "16", "href": "/roster.aspx?rp_id=14230", "Full Name": "Earl Semper", "Pos.": "OF", "Ht.": "6-2", "Wt.": "194", "Academic Year": "Fr.", "Hometown / High School": "Sunrise, Fla. / St. Thomas Aquinas", "bio": "\r\n                        Biography\r\n                                                    \r\n                            St. Thomas Aquinas\r\nNo. 5 third baseman in Florida and No. 21 overall • 2017 Rawlings-Perfect Game Honorable Mention All-American • 2017 All-Region Second Team • Two-time district champion • HSBN All-Broward Team • HSBN Senior All-American • Career .403 batting average with six home runs, 50 RBI and a .662 slugging percentage • Honor roll student junior and senior year • Spanish honors society.\r\n\r\nPersonal\r\nSon of Deborah and Earl Semper • Father was an All-American and played baseball at Jacksonville University • Godfather is former MLB World Series Champion Midre Cummings • Born on June 8. Has yet to declare a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Semper_Earl_bb_31.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14230&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "18", "href": "/roster.aspx?rp_id=14231", "Full Name": "Clemente Inclan", "Pos.": "3B/1B", "Ht.": "6-2", "Wt.": "202", "Academic Year": "Fr.", "Hometown / High School": "Jacksonville, Fla. / Bolles School", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Bolles School\r\nNo. 4 ranked third baseman in Florida and No. 18 overall • 2017 Rawlings Perfect Game Honorable Mention All-American • Florida All Region Second Team • Back-to-back state champion with Bolles • Hit .375 with five home runs, 28 runs and 25 RBI in senior season • Recipient of The Bolles School Babe Ruth Award.\r\n\r\n\r\n\r\nPersonal\r\nClemente is the son of Natalie and Clemente Inclan • Honors student at The Bolles School • Fellowship of Christian Athletes Member • Born on Nov. 16 • Has yet to declare a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Inclan_Clemente_bb_41.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14231&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "19", "href": "/roster.aspx?rp_id=14210", "Full Name": "Brett Daniels", "Pos.": "RHP", "Ht.": "6-0", "Wt.": "194", "Academic Year": "Sr.", "Hometown / High School": "Fuquay-Varina, N.C. / Fuquay-Varina", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Veteran righty who figures to be a key piece of the Carolina bullpen as a senior.\r\n\r\nJunior Season (2017)\r\nFinished 5-0 with a 2.68 ERA and 33 strikeouts as a junior • Appeared in 27 games out of the bullpen and worked 40.1 innings • Pitched a scoreless inning against Michigan in the NCAA Chapel Hill Regional • Worked 2.1 shutout innings to get the win at Virginia Tech on May 14 • Pitched four scoreless frames across two games against Clemson, picking up a relief win on April 29 • Got the win in three straight outings in March, including a nine-strikeout appearance at Georgia Tech on March 19 • Went a season-high 4.1 innings against the Yellow Jackets, allowing just two hits and no runs.\r\n\r\nSophomore Season (2016)\r\nHad a breakout season, emerging as a key piece of the Carolina bullpen • Appeared in 23 games and finished 2-1 with a 2.17 ERA in 37.1 innings of work • Struck out 34 batters on the year and fanned at least one batter in 17 games • Pitched more than one inning in 13 of 23 appearances, including a career-high 3.0 frames on three occasions • Picked up his first career win with 2.2 scoreless innings against Elon on March 16 • Went three scoreless and struck out a career-high four batters against Georgia Tech on March 24 • Matched that total with four Ks against Campbell on Ap4il 27 • Got his second win of the year against Davidson on March 29, striking out three in 2.2 scoreless innings.\r\n\r\nFreshman Season (2015)\r\nAppeared in five games and made two starts as a true freshman • Struck out six batters in 5.1 innings and finished the year with a 3.38 ERA • Retired the first batter he faced in two of three relief appearances • Worked a scoreless inning of relief in the win over UNC Asheville (5/5) • Allowed one earned run and struck out two in two innings in his first career start against VCU (3/4) • Fanned two batters in one inning in his Carolina debut (2/14).\r\n\r\nFuquay-Varina High School\r\nRanked the No. 2 right-handed pitcher and the No. 6 overall player in North Carolina by Perfect Game • Among the top 150 right-handers and the top 400 players overall nationally • All-state performer as a junior • Coached by Milton Senter at Fuquay-Varina High School.\r\n\r\nPersonal\r\nTyler Brett Daniels is the son of Ken and Tracy Daniels • Birthday is Feb. 25 • Majoring in management and society at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Daniels_Brett_bb_161.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14210&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.38", "w": "0", "l": "0", "app": "5", "gs": "2", "cg": "0", "sho": "0", "sv": "0", "ip": "5.1", "h": "7", "r": "4", "er": "2", "bb": "4", "so": "6", "2b": "1", "3b": "0", "hr": "0", "bf": "29", "bavg": ".304", "wp": "1", "hbp": "1", "bk": "0", "sfa": "0", "sha": "1", "year": "2015"}, {"era": "2.17", "w": "2", "l": "1", "app": "23", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "37.1", "h": "30", "r": "11", "er": "9", "bb": "12", "so": "34", "2b": "7", "3b": "0", "hr": "2", "bf": "151", "bavg": ".227", "wp": "5", "hbp": "1", "bk": "1", "sfa": "2", "sha": "4", "year": "2016"}, {"era": "2.68", "w": "5", "l": "0", "app": "27", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "40.1", "h": "34", "r": "14", "er": "12", "bb": "20", "so": "33", "2b": "5", "3b": "2", "hr": "2", "bf": "176", "bavg": ".228", "wp": "2", "hbp": "2", "bk": "0", "sfa": "2", "sha": "3", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "5", "gs": "2", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "0", "a": "2", "e": "1", "fld%": ".667", "year": "2015"}, {"avg": "NaN", "gp": "23", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "0", "a": "7", "e": "1", "fld%": ".875", "year": "2016"}, {"avg": "NaN", "gp": "27", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "6", "a": "9", "e": "3", "fld%": ".833", "year": "2017"}]}}}, {"#": "23", "href": "/roster.aspx?rp_id=14205", "Full Name": "Tyler Baum", "Pos.": "RHP", "Ht.": "6-2", "Wt.": "180", "Academic Year": "So.", "Hometown / High School": "Ocoee, Fla. / West Orange", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Talented right-hander who should compete for a spot in the weekend rotation as a sophomore.\r\n\r\nFreshman Season (2017)\r\nFinished 7-0 with a 2.57 ERA in 63.0 innings as a true freshman • Struck out 47 batters on the year • Made 15 starts, primarily in a midweek role • Became the eighth pitcher in Carolina history to win at least seven decisions without a loss in a single season and the first since Adam Warren went 12-0 in 2007 • Allowed one run over 5.1 innings to beat FGCU in the 2017 NCAA Chapel Hill Regional • Made two starts in the ACC tournament, picking up a win with three scoreless frames against Boston College • Went a season-long 6.0 innings and allowed just one hit and no runs in a win over UNCW on May 16 • In his only relief appearance of the year, retired all four batters he faced to pick up the victory at Florida State on April 2 • Won his first three career starts, including being a part of a combined one-hitter against Maryland on March 14 • Struck out a season-high six batters in his collegiate debut, a win over Winthrop • Earned all-league honors in the Cape Cod League after a standout summer with the Harwich Mariners.\r\nWest Orange High School\r\nRanked as the No. 17 overall player in Prep Baseball Report's national coverage area • Chosen as the No. 91 overall prospect in the BA500 by Baseball America and No. 53 by Perfect Game • The No. 7 right-handed pitcher in the country according to PBR • Also considered the No. 2 right-handed pitcher and the No. 7 overall player in Florida by Perfect Game • 2016 Rawlings-Perfect Game first-team All-American • 2015 PG Underclass All-American (second team) • Helped Scorpions 2015 Prime squad to a PG World Series title • Member of the National Honor Society • Coached by Jesse Marlo • Tyler Cole Baum is the son of Derek and Penny Baum • Father played football at Cornell and mother was a two-sport athlete at Endicott College • Sister Torey is committed to play volleyball at USC • Birthday is Jan. 14.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Baum_Tyler_bb_126.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14205&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "2.57", "w": "7", "l": "0", "app": "16", "gs": "15", "cg": "0", "sho": "0", "sv": "0", "ip": "63.0", "h": "47", "r": "18", "er": "18", "bb": "27", "so": "47", "2b": "7", "3b": "0", "hr": "6", "bf": "261", "bavg": ".208", "wp": "3", "hbp": "4", "bk": "0", "sfa": "0", "sha": "4", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "16", "gs": "15", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "5", "a": "6", "e": "1", "fld%": ".917", "year": "2017"}]}}}, {"#": "24", "href": "/roster.aspx?rp_id=14208", "Full Name": "Hansen Butler", "Pos.": "RHP", "Ht.": "5-11", "Wt.": "180", "Academic Year": "R-Jr.", "Hometown / High School": "High Point, N.C. / High Point Christian", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Missed the 2017 season due to injury • Named to the ACC Academic Honor Roll.\r\n\r\nSophomore Season (2016)\r\nAppeared in 14 games out of the bullpen, posting a 3-0 record with two saves and a 2.00 ERA in 18.0 innings of work • Struck out 24 batters and walked just nine • Posted multiple strikeouts in nine of 14 appearances • Got the final two outs in the season-opening win at UCLA for his first career save • Tossed 2.1 innings of scoreless relief and picked up his first win of the year against Oklahoma State on Feb. 28 • Missed six weeks from March 2 to April 17 with an injury • Worked two innings to improve to 3-0 against UNCW on April 26 • Posted a perfect ninth with two strikeouts for his second save in the 3-0 win over Notre Dame on May 13 • Allowed just one extra-base hit the entire season • Pitched in the Cape Cod League this summer with Brewster and had a 2.65 ERA in 20.1 innings.\r\n\r\nFreshman Season (2015)\r\nAppeared in 19 games out of the bullpen, finishing the season with a record of 1-0 and an ERA of 3.38 in 21.1 innings • Struck out 25 batters and walked 12 on the year • Had at least one strikeout in 14 of 19 appearances • Pitched in two ACC tournament games, including 1.1 scoreless innings against Louisville (5/20) • Fanned a season-high five batters in three shutout frames at UNCW (4/23) • Went a span of five appearances without allowing a run from April 8 to May 9 • Tossed three shutout innings with just 38 pitches in the win over VCU (3/4) • Picked up his first collegiate victory with 1.2 scoreless innings of relief against Rhode Island (2/27) • Struck out one in his UNC debut against Seton Hall (2/13) • Stranded 15 of 23 inherited runners and retired the first batter he faced in 10 of 19 appearances.\r\n\r\nHigh Point Christian\r\nRanked the top right-handed pitcher and the No. 5 overall player in the state of North Carolina by Perfect Game • Named a 2012 PG Underclass All-America Honorable Mention and 2013 PG Underclass Third-Team All-America • Coached by Corey Gesell at High Point Christian.\r\n\r\nPersonal\r\nHansen Raleigh Butler is the son of Scott and Teresa Butler • Birthday is Oct. 30 • Majoring in management and society at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Butler_Hansen_bb_115.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14208&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.38", "w": "1", "l": "0", "app": "19", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "21.1", "h": "30", "r": "10", "er": "8", "bb": "12", "so": "25", "2b": "4", "3b": "1", "hr": "0", "bf": "106", "bavg": ".333", "wp": "2", "hbp": "2", "bk": "0", "sfa": "1", "sha": "1", "year": "2015"}, {"era": "2.00", "w": "3", "l": "0", "app": "14", "gs": "0", "cg": "0", "sho": "0", "sv": "2", "ip": "18.0", "h": "15", "r": "6", "er": "4", "bb": "9", "so": "24", "2b": "1", "3b": "0", "hr": "0", "bf": "79", "bavg": ".231", "wp": "2", "hbp": "2", "bk": "0", "sfa": "0", "sha": "3", "year": "2016"}], "Hitting Statistics": [{"avg": "NaN", "gp": "19", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "1", "a": "3", "e": "1", "fld%": ".800", "year": "2015"}, {"avg": "NaN", "gp": "14", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "1", "a": "2", "e": "0", "fld%": "1.000", "year": "2016"}]}}}, {"#": "25", "href": "/roster.aspx?rp_id=14223", "Full Name": "Taylor Sugg", "Pos.": "RHP", "Ht.": "6-1", "Wt.": "175", "Academic Year": "Jr.", "Hometown / High School": "Greensboro, N.C. / Southern Guilford", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nAppeared in 17 games and made three starts • Finished 1-1 with a 1.95 ERA in 27.2 innings of work • Also struck out 18 batters on the year • His three starts all came in the final month of the season, including the NCAA Chapel Hill Regional against Davidson • Did not allow a run in 3.2 innings of relief during the ACC tournament • Went 3.2 scoreless in a start at Virginia Tech on May 14 • Did not allow an earned run in 12 of 14 relief appearances.\r\n\r\nFreshman Season (2016)\r\nLive-armed freshman appeared in 14 games out of the bullpen • Posted a 2.45 ERA with one save in 14.2 innings of work • Struck out 16 and walked just five • Fanned multiple batters on three occasions, including a season-best five against Elon on March 16 • Worked two scoreless innings with three strikeouts on just 18 pitches against High Point on April 5 • Struck out the side against South Carolina on April 13 • Picked up his first career save in the Elon game, working three scoreless frames to end the game.\r\n\r\nSouthern Guilford High School\r\nThree-time all-conference performer who was named all-area as a senior • Struck out 103 batters in his senior season • Led team to a conference title as a junior • Earned a Greenhand Degree in FFA • Ranked the No. 25 right-handed pitcher and the No. 80 overall player in the state of North Carolina by Perfect Game • Earned Underclass Honorable Mention from PG in 2014 • Competed at the 2014 PG WWBA World Championship • Coached by Jeff Carter at Southern Guilford.\r\n\r\nPersonal\r\nTaylor Bradyn Sugg is the son of Mike and Justina Sugg • Birthday is July 31 • Has not yet declared a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Sugg_Taylor_bb_149.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14223&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "2.45", "w": "0", "l": "0", "app": "14", "gs": "0", "cg": "0", "sho": "0", "sv": "1", "ip": "14.2", "h": "17", "r": "8", "er": "4", "bb": "5", "so": "16", "2b": "2", "3b": "0", "hr": "1", "bf": "69", "bavg": ".283", "wp": "3", "hbp": "3", "bk": "0", "sfa": "0", "sha": "1", "year": "2016"}, {"era": "1.95", "w": "1", "l": "1", "app": "17", "gs": "3", "cg": "0", "sho": "0", "sv": "0", "ip": "27.2", "h": "24", "r": "7", "er": "6", "bb": "14", "so": "18", "2b": "4", "3b": "0", "hr": "0", "bf": "123", "bavg": ".229", "wp": "4", "hbp": "1", "bk": "0", "sfa": "1", "sha": "2", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "14", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "1", "a": "1", "e": "0", "fld%": "1.000", "year": "2016"}, {"avg": "NaN", "gp": "17", "gs": "3", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "1", "a": "2", "e": "1", "fld%": ".750", "year": "2017"}]}}}, {"#": "26", "href": "/roster.aspx?rp_id=14232", "Full Name": "Jackson Hesterlee", "Pos.": "OF", "Ht.": "6-4", "Wt.": "210", "Academic Year": "Jr.", "Hometown / High School": "Carrollton, Ga. / Carrollton", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Prior to UNC\r\nSpent two seasons at Southern Union State Community College • Named 2017 Alabama Sports Writers Association’s Community College Athlete of the Year • Led the conference with a .420 batting average while driving in 52 runs in 50 games • Named 2017 ACCC North Division Player of the Year • Third-team JUCO All-American • 2017 ACCC Athlete of the Year • Won 2014 state championship with Carrollton High School • All-State baseball selection senior year at Carrollton High • First-team NJCAA All-Academic Team • UGA Merit Scholar at Carrollton High\r\n\r\nPersonal\r\nGraduated from Southern Union State with a 4.0 GPA as a honor graduate with distinction • Member of Pi Theta Kappa at Southern Union State • Father played college baseball at the University of West Georgia • Jackson is the son of Jill and David Hesterlee • Born on March 17.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Hesterlee_Jackson_bb_18.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14232&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "27", "href": "/roster.aspx?rp_id=14241", "Full Name": "Jason Morgan", "Pos.": "RHP", "Ht.": "6-6", "Wt.": "213", "Academic Year": "R-Jr.", "Hometown / High School": "Fredericksburg, Va. / Chancellor", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Junior Season (2017)\r\nFinished 3-0 with a 3.92 ERA in 43.2 innings of work • Made 18 appearances and seven starts, striking out 36 batters on the year • Struck out five and did not walk a batter in four innings of relief to pick up the win over South Carolina in Charlotte on April 11 • In one of his best outings of the year, allowed just one hit over 4.1 innings of relief in a win at Florida State on April 2 • Won each of his first two starts of the year with 5.2 innings of work against Kentucky and Radford.\r\n\r\nSophomore Season (2016)\r\nWon a weekend starting job during the preseason and made 15 starts in his sophomore season • Finished 3-3 with a 4.10 ERA in 63.2 innings • Struck out 47 batters and walked 32 on the year • Worked at least six innings in each of his three wins • In perhaps the best outing of his career so far, tossed seven shutout innings with five strikeouts in a win at Duke on March 20 • Went six scoreless against VCU on May 3 and against Fairfield on March 6 • Struck out a career-high seven batters in the win over the Stags • Named to the ACC Academic Honor Roll • Had a successful summer in the Cape Cod League, posting a 3-1 record with a 3.68 ERA for Orleans.\r\n\r\nFreshman Season (2015)\r\nTalented right-hander who will compete for a starting job after spending most of his rookie year in the bullpen • Finished with a 3.91 ERA in 23.0 innings • Made his lone start of the year against Coastal Carolina (4/7) and allowed two unearned runs in 3.1 innings • Did some of his best work against ACC opponents, going 2.1 scoreless innings in relief against Virginia (5/15) and Miami (3/29) • Struck out two in a perfect inning against Appalachian State (3/24) • Earned a rare 15-out save against Gardner-Webb (3/11) after allowing just one run on five hits in 5.0 innings of relief • Worked 2.2 scoreless frames in his UNC debut against Duke (3/8).\r\n\r\nChancellor High School\r\nRanked the No. 5 right-handed pitcher and the No. 12 player overall in Virginia by Perfect Game • Rated the No. 103 right-hander in the country by PG • 2013 Underclass High Honorable Mention by PG • Coached by J.P. Gibbons at Chancellor High School.\r\n\r\nPersonal\r\nJason Christopher Morgan is the son of Scott and Kay Morgan • Birthday is Feb. 17 • Majoring in exercise and sport science at Carolina with a concentration in fitness.\r\n\r\n                        \r\n                    ", "img": "/images/2018/2/1/Morgan_Jason_bb_157.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14241&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.91", "w": "0", "l": "0", "app": "12", "gs": "1", "cg": "0", "sho": "0", "sv": "1", "ip": "23.0", "h": "28", "r": "12", "er": "10", "bb": "5", "so": "8", "2b": "5", "3b": "0", "hr": "1", "bf": "103", "bavg": ".304", "wp": "0", "hbp": "5", "bk": "0", "sfa": "0", "sha": "1", "year": "2015"}, {"era": "4.10", "w": "3", "l": "3", "app": "15", "gs": "15", "cg": "0", "sho": "0", "sv": "0", "ip": "63.2", "h": "56", "r": "34", "er": "29", "bb": "32", "so": "47", "2b": "6", "3b": "1", "hr": "6", "bf": "288", "bavg": ".229", "wp": "3", "hbp": "6", "bk": "0", "sfa": "1", "sha": "4", "year": "2016"}, {"era": "3.92", "w": "3", "l": "0", "app": "18", "gs": "7", "cg": "0", "sho": "0", "sv": "0", "ip": "43.2", "h": "41", "r": "21", "er": "19", "bb": "20", "so": "36", "2b": "5", "3b": "0", "hr": "4", "bf": "198", "bavg": ".246", "wp": "4", "hbp": "8", "bk": "0", "sfa": "0", "sha": "3", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "12", "gs": "1", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "3", "a": "4", "e": "1", "fld%": ".875", "year": "2015"}, {"avg": "NaN", "gp": "15", "gs": "15", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "3", "a": "8", "e": "2", "fld%": ".846", "year": "2016"}, {"avg": "NaN", "gp": "18", "gs": "7", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "4", "a": "10", "e": "1", "fld%": ".933", "year": "2017"}]}}}, {"#": "29", "href": "/roster.aspx?rp_id=14214", "Full Name": "Trevor Gay", "Pos.": "RHP", "Ht.": "6-3", "Wt.": "199", "Academic Year": "Jr.", "Hometown / High School": "High Point, N.C. / High Point Central", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nSide-winding righty made 16 relief appearances in 2017 • Finished 1-0 with a 3.65 ERA and 14 strikeouts in 12.1 innings of work • Went at least a full inning in eight appearances, including a season-long 2.0 frames against St. John's on March 1 • Worked a scoreless inning against FGCU in the NCAA Chapel Hill Regional • Struck out a season-high three batters against Davidson on May 9 • Picked up his first win as a Tar Heel with a scoreless inning against Elon on April 25.\r\nPrior to Carolina\r\nRanked as the No. 20 right-handed pitcher and the No. 49 overall player in the state of North Carolina as a high school senior in 2014 • Made 23 appearances as a freshman at Charlotte in 2015, posting a 3-3 record with 25 strikeouts in 40.2 innings and a 5.98 ERA • Sat out last spring per NCAA transfer rules • Trevor Robert Gay is the son of Kim and Rob Gay • Both parents went to UNC, brother goes to Duke and uncle played football at NC State • Birthday is Oct. 30.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Gay_Trevor_bb_152.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14214&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.65", "w": "1", "l": "0", "app": "16", "gs": "0", "cg": "0", "sho": "0", "sv": "0", "ip": "12.1", "h": "11", "r": "7", "er": "5", "bb": "7", "so": "14", "2b": "4", "3b": "0", "hr": "0", "bf": "55", "bavg": ".244", "wp": "2", "hbp": "2", "bk": "0", "sfa": "0", "sha": "1", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "16", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "0", "a": "3", "e": "0", "fld%": "1.000", "year": "2017"}]}}}, {"#": "31", "href": "/roster.aspx?rp_id=14215", "Full Name": "Josh Hiatt", "Pos.": "RHP", "Ht.": "5-11", "Wt.": "190", "Academic Year": "R-So.", "Hometown / High School": "Charlotte, N.C. / Providence", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Redshirt Freshman Season (2017)\r\nElectric right-handed reliever who won the closer role in the preseason and quickly emerged as one of the top late-inning guys in college baseball • Finished 4-2 with 13 saves and a 1.90 ERA over 52.0 innings of work • Made a team-high 32 appearances on the year and his 13 saves were fifth-most in UNC single-season history • Earned first-team All-America honors from Baseball America and the NCBWA • Was a consensus freshman All-American, earning first-team freshman honors from Baseball America, Collegiate Baseball, D1Baseball, NCBWA and Perfect Game • NCBWA Stopper of the Year Award Finalist • ABCA/Rawlings first-team all-region selection • Earned first-team All-ACC honors as a reliever • Matched a season high with 4.2 scoreless innings against Davidson in the NCAA Chapel Hill Regional • Allowed an earned run in just four of 32 appearances and finished the regular season with a 1.00 ERA • Appeared in all three games of the Clemson sweep, allowing no runs and three hits over 5.2 innings with a win and a save • Earned ACC Pitcher of the Week honors for his performance against the Tigers • Struck out a season-high six batters against NC State on April 16 • Picked up his first collegiate win with 2.2 scoreless innings at Florida State on April 1 • Also worked a six-out save against the Noles to help UNC to its first-ever sweep in Tallahassee • Recorded a save in each of his first five appearances, including saving all three wins of the season-opening sweep of Kentucky • Shared the team's S.H. Basnight Award for most valuable pitcher with J.B. Bukauskas.\r\n\r\nProvidence High School\r\nFour-year varsity pitcher who also played middle infield • All-state and Louisville Slugger first-team as a senior • Ranked the No. 5 right-handed pitcher and the No. 17 overall player in the state of North Carolina by Perfect Game • Earned 2014 Underclass High Honorable Mention and 2013 Underclass Honorable Mention from PG • Named to the Top Prospect Team at the 2013 Atlantic Coast Top Prospect Showcase • Coached by Danny Hignight at Providence. \r\n\r\nPersonal\r\nJoshua Landen Hiatt is the son of Earl and Angie Hiatt • Birthday is March 27 • Plans to major in business at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Hiatt_Josh_bb_124.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14215&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "1.90", "w": "4", "l": "2", "app": "32", "gs": "0", "cg": "0", "sho": "0", "sv": "13", "ip": "52.0", "h": "31", "r": "13", "er": "11", "bb": "20", "so": "64", "2b": "2", "3b": "0", "hr": "3", "bf": "213", "bavg": ".168", "wp": "9", "hbp": "8", "bk": "0", "sfa": "0", "sha": "1", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "32", "gs": "0", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "5", "a": "2", "e": "0", "fld%": "1.000", "year": "2017"}]}}}, {"#": "34", "href": "/roster.aspx?rp_id=14233", "Full Name": "Caden O'Brien", "Pos.": "LHP", "Ht.": "6-1", "Wt.": "190", "Academic Year": "Fr.", "Hometown / High School": "Maiden, N.C. / Maiden", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Maiden High School\r\nNo. 5 left-handed pitcher in North Carolina and No. 35 overall player by Perfect Game • 2017 Rawlings-Perfect Game Honorable Mention All-American • All-Atlantic Region Second Team • Selected to the 2017 All-State team • 2017 Conference Pitcher of the Year • Went 8-1 his senior year with a 1.11 ERA, 115 strikeouts and 13 walks • Threw three no-hitters during his high school career • Summa Cum Laude and Beta Club member.\r\n\r\nPersonal\r\nCaden is the son of Carol and Eddie Cruse • Born on January 24 • First member of his family to attend college.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/O_Brien_Caden_bb_94.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14233&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "36", "href": "/roster.aspx?rp_id=14234", "Full Name": "Joey Lancellotti", "Pos.": "RHP/OF", "Ht.": "5-11", "Wt.": "205", "Academic Year": "Fr.", "Hometown / High School": "Bensalem, Pa. / William Penn Charter", "bio": "\r\n                        Biography\r\n                                                    \r\n                            William Penn Charter\r\nNo. 2 pitcher in Pennsylvania and No. 28 pitcher nationally • MVP Pitcher at 2016 WWBA • Member of the East Cobb Astros that won the 2016 WWBA National Championship • 2015 and 2017 Southeastern Pennsylvania Player of the Year • 2017 Prep Baseball Report and Perfect Game Pennsylvania Player of the Year • 2017 Rawlings-Perfect Game second team All-American • All-Atlantic Region First Team • 2016 Team USA 40 man roster • Went 7-1 during his senior year with a 0.31 ERA and 85 strikeouts in 45.2 innings • Hit .493 with 10 home runs and 34 RBI • Member of Athletes Helping Athletes.\r\n\r\nPersonal\r\nSon of Joseph and Janine Lancellotti • Sister Gianna is first team all-league softball player at Archbishop Wood High School • Plays guitar and likes to fish • Born on January 15 • Has yet to declare a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Lancellotti_Joey_bb_89.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14234&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "37", "href": "/roster.aspx?rp_id=14224", "Full Name": "Bo Weiss", "Pos.": "RHP", "Ht.": "6-3", "Wt.": "181", "Academic Year": "So.", "Hometown / High School": "Castle Rock, Colo. / Regis Jesuit", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nAppeared in 15 games and made one start as a true freshman • Posted a 2.70 ERA over 16.2 innings with 14 strikeouts • Allowed one run over 3.0 innings of work in his start against UNC Asheville on May 10 • Worked at least one inning in 13 of 15 appearances • Did not allow a run in 10 of 14 relief outings • Struck out the side in his one inning of work against Elon on April 25 • Named to the ACC Academic Honor Roll.\r\nRegis Jesuit High School\r\nRanked as the No. 29 player in the country and the No. 12 right-handed pitcher in Prep Baseball Report's national coverage area • Also ranked No. 183 in Baseball America's BA500 and No. 98 nationally by Perfect Game • Selected in the 29th round of the 2016 MLB Draft by the New York Yankees • Listed as the best player overall in the state of Colorado by Perfect Game • 2016 Rawlings-Perfect Game All-American (second team) • 2015 PG Underclass All-American (first team) • All-state pick as a senior and a first-team all-state academic award winner • Twice named to the Futures All-Star game • Son of former UNC star, MLB standout and Colorado Rockies manager Walt Weiss • Coached by Mark Holzemer • Plays the guitar • Brother Brody plays baseball at UCSB • Bo Lance Weiss is the son of Walt and Terri Weiss • Birthday is July 24.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Weiss_Bo_bb_134.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14224&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "2.70", "w": "0", "l": "0", "app": "15", "gs": "1", "cg": "0", "sho": "0", "sv": "0", "ip": "16.2", "h": "15", "r": "6", "er": "5", "bb": "8", "so": "14", "2b": "3", "3b": "0", "hr": "0", "bf": "77", "bavg": ".246", "wp": "2", "hbp": "6", "bk": "0", "sfa": "1", "sha": "1", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "15", "gs": "1", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "1", "a": "1", "e": "0", "fld%": "1.000", "year": "2017"}]}}}, {"#": "38", "href": "/roster.aspx?rp_id=14235", "Full Name": "Kip Brandenburg", "Pos.": "OF/1B", "Ht.": "6-5", "Wt.": "207", "Academic Year": "So.", "Hometown / High School": "Greensboro, N.C. / Southern Guilford", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Prior to UNC\r\nSpent his freshman season at Spartanburg Methodist • Appeared in 56 games and finished with a .337 average with a .651 slugging percentage • Scored 41 runs while driving in 44 RBI • Finished with 11 home runs, 17 doubles and one triple • First Team All-Atlantic Region by Perfect Game senior season in high school • Hit .456 with five home runs during his senior campaign.\r\n\r\nPersonal\r\nKip is the son of Carla and Charles Brandenburg • Born on January 22 • Brother Kyle played baseball at High Point University and most recently played for the AA Winnipeg Goldeyes and the CAMA Ottawa Champions • His sister Courtney is a chiropractor and brother Corey is at school at UNCW.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Brandenburg_Kip_bb_26.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14235&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "39", "href": "/roster.aspx?rp_id=14236", "Full Name": "Kyle Blendinger", "Pos.": "RHP", "Ht.": "6-1", "Wt.": "185", "Academic Year": "Fr.", "Hometown / High School": "High Point, N.C. / Southwest Guilford", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Southwest Guilford High School\r\nRanked as the No. 4 pitcher and the No. 13 overall player in the state of North Carolina • Named a 2017 Rawlings-Perfect Game Honorable Mention All-American • 2017 Atlantic All-Regional 1st Team • Three-Time All-Conference Player • All-area and all-state selection junior and senior year as well as conference pitcher of the year • Bobby Murray Invitational All-Tournament & MVP selection • Went 20-2 in his last two seasons at Southwest Guilford with 192 strikeouts, 59 hits and 35 walks • Coached by Reid Holmes\r\n\r\nPersonal\r\nBirthday is June 23 • Kyle Blendinger is the son of Amy and Russ Blendinger • Has yet to declare a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Blendinger_Kyle_bb_87_71.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14236&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "40", "href": "/roster.aspx?rp_id=14237", "Full Name": "Angel Zarate", "Pos.": "OF/LHP", "Ht.": "5-11", "Wt.": "180", "Academic Year": "Fr.", "Hometown / High School": "Reidsville, N.C. / Rockingham County", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Rockingham County High School\r\nNo. 4 left-handed pitcher in North Carolina and No. 23 player overall • 2017 Rawlings-Perfect Game Honorable Mention All-American • Atlantic All-Region second team • Three time-all state performer • Finished high school with a .443 batting average.\r\n\r\n\r\nPersonal\r\nSon of Delia and Carlos Zarate • Also played soccer and football in high school • Dad played professional baseball in Mexico • Born on July 16 • Has yet to declare a major at Carolina.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Zarate_Angel_bb_98.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14237&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "41", "href": "/roster.aspx?rp_id=14238", "Full Name": "Cooper Criswell", "Pos.": "RHP", "Ht.": "6-6", "Wt.": "200", "Academic Year": "Jr.", "Hometown / High School": "Carrollton, Ga. / Carrollton", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Prior to UNC\r\nSpent two seasons at Southern Union State Community College • Went 10-1 during his sophomore season with six complete games • Struck out 86 batters in 88.2 innings while only allowing eight walks with a 2.54 ERA • Led Carrollton High School to the 2014 baseball state championship • Was named All-Region and All-State First Team • Missed senior season in high school due to injury.\r\n\r\nPersonal\r\nSon of Tim Criswell who played college baseball at Georgia Perimeter College and was drafted by the San Francisco Giants with the No. 21 pick of the 1983 MLB Draft • Cooper is the son of Dawn and Tim Criswell • Honor Roll student at Carrollton High School.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Criswell_Cooper_bb_108.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14238&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "42", "href": "/roster.aspx?rp_id=14209", "Full Name": "Gianluca Dalatri", "Pos.": "RHP/DH", "Ht.": "6-6", "Wt.": "256", "Academic Year": "So.", "Hometown / High School": "Wall Township, N.J. / Christian Brothers Academy", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Freshman Season (2017)\r\nWorkhorse righty who won a weekend starting role prior to the season and spent the bulk of the 2017 campaign as Carolina's Saturday starter • Finished 7-3 with a 3.34 ERA and 85 strikeouts • Walked just 19 batters on the year and led the team with 97.0 innings of work • Consensus Freshman All-American who earned first-team honors from Baseball America, Collegiate Baseball, D1Baseball and Perfect Game • Also named to the All-ACC third team as a starting pitcher and the All-ACC Academic Team • ACC All-Freshman selection • Went at least five innings in 13 of his 15 starts, including seven starts with at least 7.0 innings of work • Allowed just one run on five hits and struck out six to beat Michigan in the NCAA Chapel Hill Regional • Came within one out of a complete game at Pitt, allowing just one run on three hits over a season-high 8.2 frames on April 22 • That capped a run of three straight starts allowing just one run that also included wins over NC State and Boston College • In his first career road start, struck out seven and allowed just one earned run over 8.0 innings over work in a no-decision at Georgia Tech • Pitched into the ninth against Virginia on March 11 in his first ACC start and was a hard-luck loser despite allowing just one earned run in 8.1 innings • In just his second collegiate start, struck out 15 and did not walk a batter across eight innings in a win over Radford on Feb. 26 • Became the first Tar Heel to strike out 15 batters in a game since Matt Harvey in 2010 • Earned ACC Pitcher of the Week honors for his performance • Got the win in his UNC debut, going seven innings to complete a sweep of Kentucky • Was a member of the USA Baseball Collegiate National Team during the summer • Named to the ACC Academic Honor Roll.\r\nChristian Brothers Academy \r\nRanked as the No. 30 player in the country and the No. 13 right-handed pitcher in Prep Baseball Report's national coverage area • Also considered the No. 104 player overall by Perfect Game and ranks No. 174 in Baseball America's BA500 • Selected in the 40th round of the 2016 MLB Draft by the Colorado Rockies • Listed as the No. 3 right-handed pitcher and the No. 5 player in the state of New Jersey by Perfect Game • 2016 Rawlings-Perfect Game third-team All-American • 2015 PG Underclass All-American (second team) • Three-time all-state performer who led his team to a state title in 2015 • Two-time Gatorade Player of the Year in New Jersey • Compiled a 30-0 record over his final three seasons of prep ball, including a 10-0 mark as a senior when he struck out 118 against just four walks • MaxPreps Underclass All-American • Coached by Marty Kenny • Gianluca Dalatri is the son of Richard and Elvira Dalatri • Father played professional football and coached in the NBA for 30 years and was the first full-time strength and conditioning coach in the league • Mother played professional basketball • Birthday is April 4.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Dalatri_Gianluca_bb_132.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14209&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.34", "w": "7", "l": "3", "app": "15", "gs": "15", "cg": "0", "sho": "0", "sv": "0", "ip": "97.0", "h": "90", "r": "41", "er": "36", "bb": "19", "so": "85", "2b": "18", "3b": "2", "hr": "7", "bf": "398", "bavg": ".245", "wp": "6", "hbp": "3", "bk": "0", "sfa": "4", "sha": "5", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "15", "gs": "15", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "4", "a": "15", "e": "1", "fld%": ".950", "year": "2017"}]}}}, {"#": "43", "href": "/roster.aspx?rp_id=14217", "Full Name": "Brendan Illies", "Pos.": "C", "Ht.": "6-1", "Wt.": "206", "Academic Year": "Jr.", "Hometown / High School": "Edgewood, Wash. / Puyallup", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nAppeared in 12 games and made one start at designated hitter • Hit .200 with three RBIs and two walks on the year • Had a pair of doubles and three RBIs, including a run-scoring double against Miami in the ACC tournament • Standout in the classroom who was named to the ACC Academic Honor Roll for the second straight year.\r\n\r\nFreshman Season (2016)\r\nAppeared in 14 games and made three starts at catcher • Hit .222 with two runs scored and two RBIs • Drove in a pair of runs with his first career hit against Western Carolina on March 22 • Also had a hit in a start at Miami on April 3 • Threw out the only runner to attempt a stolen base against him • Standout in the classroom who was named to the 2015-16 ACC Academic Honor Roll.  \r\n\r\nPuyallup High School\r\nPlayed football for two seasons in addition to four years of baseball • Led his team to a 4A state baseball title and a perfect 28-0 record in 2014 • Class valedictorian and Washington State Scholar • Named to the Perfect Game Honorable Mention All-America team as a senior • Four-time first-team all-state performer • Hit .377 with 101 RBIs in his career • Also had a 10-4 record and a 2.37 career ERA as a pitcher • Ranked the No. 1 catcher and the No. 2 player overall in the state of Washington by Perfect Game • Also considered the No. 23 catcher nationally by PG • After earning Underclass Second Team All-America honors in 2013, was named to the PG Underclass First Team All-America list in 2014 • Named to the Top Prospect Team at the 2014 National Showcase in Fort Myers, Fla. • Coached by Marc Wiese at Puyallup.\r\n\r\nPersonal\r\nBrendan Christopher Illies is the son of Shane and Gerald Illies • Birthday is Sept. 28 • Distant relative of Harry Frazee, Boston Red Sox owner who sold Babe Ruth to the New York Yankees in 1919 • Plans to major in physics at Carolina with a concentration in quantitative finance.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Illies_Brenden_bb_22_71.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14217&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Hitting Statistics": [{"avg": ".222", "gp": "14", "gs": "3", "ab": "9", "r": "2", "h": "2", "2b": "0", "3b": "0", "hr": "0", "rbi": "2", "slg%": ".222", "bb": "3", "hbp": "0", "so": "2", "gdp": "0", "ob%": ".385", "sf": "1", "sh": "0", "sb": "0", "po": "45", "a": "3", "e": "1", "fld%": ".980", "year": "2016"}, {"avg": ".200", "gp": "12", "gs": "1", "ab": "10", "r": "0", "h": "2", "2b": "2", "3b": "0", "hr": "0", "rbi": "3", "slg%": ".400", "bb": "2", "hbp": "2", "so": "1", "gdp": "0", "ob%": ".429", "sf": "0", "sh": "0", "sb": "0", "po": "0", "a": "0", "e": "0", "fld%": ".000", "year": "2017"}]}}}, {"#": "44", "href": "/roster.aspx?rp_id=14239", "Full Name": "Austin Love", "Pos.": "RHP", "Ht.": "6-3", "Wt.": "232", "Academic Year": "Fr.", "Hometown / High School": "Salisbury, N.C. / West Rowan", "bio": "\r\n                        Biography\r\n                                                    \r\n                            West Rowan High School\r\nNo. 9 pitcher in North Carolina and No. 24 overall player in North Carolina • 2017 Rawlings-Perfect Game Honorable Mention • All-Atlantic Region Second Team • Selected to the 2017 All-State team • Went 5-2 with an ERA of 0.83 during his senior campaign with 56 strikeouts and 13 walks • Career ERA of 1.42 with 232 strikeouts in 163 innings.\r\n\r\nPersonal\r\nAustin is the son of Jill and Steve Love • Graduated high school with a 4.1 GPA and as a member of Student Council • North Carolina Scholar • Born on January 26 • Brother played baseball at Catawba, CVCC and UNC-Pembroke • Great uncle is in the Baseball Hall of Fame. \r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Love_Austin_bb_105.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14239&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "45", "href": "/roster.aspx?rp_id=14206", "Full Name": "Austin Bergner", "Pos.": "RHP", "Ht.": "6-4", "Wt.": "200", "Academic Year": "So.", "Hometown / High School": "Windermere, Fla. / Windermere Prep", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Hard-throwing righty who looks poised to move into a starting role as a sophomore.\r\n\r\nFreshman Season (2017)\r\nFinished 4-2 with a 3.00 ERA in 48.0 innings as a true freshman • Made three weekend starts but was primarily used as a reliever in 2017 • Struck out 45 batters and allowed just five extra-base hits on the year • Limited opponents to a .215 batting average • Did not allow a run in five postseason appearances, including a pair of scoreless outings against Davidson and FGCU in the NCAA Chapel Hill Regional • Picked up his first career save with a shutout inning in the regular season finale against Duke, a victory that secured UNC's 10th consecutive ACC series win • Picked up the win in his first career start with 5.0 innings of two-hit ball in a victory over Boston College on April 9 • Struck out a season-high five batters in a start against NC State on April 16 • Worked two scoreless frames to get the win over East Carolina on April 4 • Notched his first collegiate win with 3.0 innings of scoreless relief against Virginia on March 11 • Earned all-league honors in the Cape Cod League after a standout summer with the Chatham Anglers.\r\nWindermere Prep\r\nRanked as the No. 4 overall player in Prep Baseball Report's national coverage area • Also ranked No. 38 nationally by Perfect Game and No. 165 by Baseball America • Selected in the 38th round of the 2016 MLB Draft by the Boston Red Sox • Also considered the No. 1 right-handed pitcher and the No. 5 overall player in Florida by Perfect Game and the No. 3 right-handed pitcher nationally by PBR • Played with USA Baseball from 2014-16, where he was a Pan-Am Champion and a World Cup Champion • 2016 Rawlings-Perfect Game first-team All-American • Two-time PG Underclass All-America (first team) • Selected to play in the PG All-American Game • MaxPreps Underclass All-American • Coached by Scott Horvath • Austin Stone Bergner is the son of Mark and Claudia Bergner • Father played professional beach volleyball and coached volleyball at Duke • Birthday is May 1.\r\n                        \r\n                    ", "img": "/images/2018/1/31/Bergner_Austin_bb_138.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14206&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "3.00", "w": "4", "l": "2", "app": "27", "gs": "3", "cg": "0", "sho": "0", "sv": "1", "ip": "48.0", "h": "35", "r": "20", "er": "16", "bb": "25", "so": "45", "2b": "2", "3b": "0", "hr": "3", "bf": "204", "bavg": ".202", "wp": "2", "hbp": "1", "bk": "0", "sfa": "3", "sha": "2", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "27", "gs": "3", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "4", "a": "5", "e": "0", "fld%": "1.000", "year": "2017"}]}}}, {"#": "46", "href": "/roster.aspx?rp_id=14240", "Full Name": "Ben Casparius", "Pos.": "INF/RHP", "Ht.": "6-1", "Wt.": "214", "Academic Year": "Fr.", "Hometown / High School": "Westport, Conn. / Staples", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Staples\r\nNo. 1 overall player in the state of Connecticut and No. 22 shortstop in the country by Perfect Game • 2017 Connecticut Gatorade Player of the Year • Led Staples High School to the 2017 State Championship • 2017 Coaches Association Player of the Year • All-time hits leader in the state of Connecticut • All-Academic First Team All-State • Tri-State Player of the Year • Perfect Game Third Team All-American • USA Today Connecticut Player of the Year • Hit .490 with 11 home runs during his senior season • Went 5-1 with a 1.90 ERA and 85 strikeouts on the mound.\r\n\r\nPersonal\r\nBen is the son of Stacey and Phil Casparius • Born on February 11 • A member of the Service League of Boys • Volunteered at local homeless shelters in Connecticut • Has not yet declared a major at Carolina \r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Casparius_Ben_bb_111.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14240&path=baseball&year=2018&player_id=0", "stats": {}}, {"#": "48", "href": "/roster.aspx?rp_id=14216", "Full Name": "Rodney Hutchison Jr.", "Pos.": "RHP", "Ht.": "6-6", "Wt.": "239", "Academic Year": "Jr.", "Hometown / High School": "Mason, Ohio / Mason", "bio": "\r\n                        Biography\r\n                                                    \r\n                            Sophomore Season (2017)\r\nDurable righty who emerged as a key bullpen piece as a sophomore • Made 31 total appearances, including 30 in relief, and finished 7-4 with a 4.14 ERA and 53 strikeouts • Issued just 17 walks in 58.2 innings, including a team-high 57.0 relief innings • Went at least two innings in relief on 13 occasions, including a season-high 5.0 innings against Miami on March 26 • Worked three shutout frames to get the win over Miami in the ACC tournament • Had 15 multi-strikeout appearances, including a season-high five punchouts four times • Struck out four and allowed just one hit over 4.2 innings in a win at Virginia Tech on May 13 • Had five strikeouts over 4.0 scoreless to beat Boston College on April 8 • Beat East Carolina on March 22 with 4.2 shutout innings.\r\n\r\nFreshman Season (2016)\r\nAppeared in eight games and made three starts as a true freshman • Finished 1-2 with a 5.82 ERA and 16 strikeouts in 17.0 innings • Picked up his first career win against Campbell on April 27 • Worked 5.1 innings and allowed just two earned runs against the Camels • Impressed against eventualy NCAA champ Coastal Carolina on April 19, tossing 4.2 scoreless innings and striking out a career-high seven Chanticleer batters.\r\n\r\nMason High School\r\nPlayed four seasons of basketball in addition to being an all-state performer in baseball • Also played two seasons of football and one of hockey • Ranked the No. 3 right-handed pitcher and the No. 5 overall player in the state of Ohio by Perfect Game • Also considered the No. 97 right-hander nationally by PG • Earned 2014 Underclass High Honorable Mention from PG • Also plays basketball at Mason • Coached by Curt Bly at Mason.\r\n\r\nPersonal\r\nRodney Dean Hutchison Jr. is the son of Rodney and Stephani Hutchison • Birthday is Aug. 8 • Grandfather played professionally for the White Sox • Plans to major in exercise science at Carolina with a concentration in sport administration.\r\n\r\n                        \r\n                    ", "img": "/images/2018/1/31/Hutchison_Rodney_bb_119.jpg?width=300", "stats_url": "http://goheels.com/services/responsive-roster-bio.ashx?type=stats&rp_id=14216&path=baseball&year=2018&player_id=0", "stats": {"career_stats": {"Pitching Statistics": [{"era": "4.14", "w": "7", "l": "4", "app": "31", "gs": "1", "cg": "0", "sho": "0", "sv": "1", "ip": "58.2", "h": "58", "r": "30", "er": "27", "bb": "17", "so": "53", "2b": "7", "3b": "3", "hr": "3", "bf": "252", "bavg": ".259", "wp": "2", "hbp": "8", "bk": "1", "sfa": "1", "sha": "2", "year": "2017"}], "Hitting Statistics": [{"avg": "NaN", "gp": "31", "gs": "1", "ab": "0", "r": "0", "h": "0", "2b": "0", "3b": "0", "hr": "0", "rbi": "0", "slg%": ".000", "bb": "0", "hbp": "0", "so": "0", "gdp": "0", "ob%": ".000", "sf": "0", "sh": "0", "sb": "0", "po": "5", "a": "6", "e": "0", "fld%": "1.000", "year": "2017"}]}}}]